PHP
Hypertext Preprocessor
Мова програмування, початково призначена для покращення засобів 
HTML (змінні, інструкції, вирази, файли/шаблони)
На сьогодні - повноцінна мова програмування, яка частіше за все 
використовується для задач бекенду. 

За приблизною аналогією з JS, PHP має подвійне розуміння
- частина (модуль) веб-сервера, яка продовжує оброблення запитів
- самостійний продукт для виконання програм 

Для встановлення краще за все використати збірку (налаштовані 
між собою веб-сервер, PHP, СУБД та інше). Такими є
XAMPP, OpenServer, Danver, ...
                                    сайт 1 (index.php)
веб-запит --> [Apache(веб-сервер)] < ... >
                                    сайт N (index.php)

веб-сервер приймає запит,  розбирає його (виділяє метод, заголовки,
передані форми, файли тощо) та запускає PHP файл у запитаному сайті
Те, що виводить PHP, передається сервером як відповідь на запит.  
!! Виведення PHP потрапляє не на "екран", а в тіло HTML

- Тип мови: інтерпретатор REPL
- 4GL
- парадигма: процедурна (з підтримкою ООП)

===============================================

Для зручності роботи з кількома проєктами (сайтами) бажано налаштувати 
локальний хостінг. 
- папка з конфігурацією сервера Apache (conf/extra/) 
- відкриваємо у редакторі httpd-vhosts.conf
- за зразком, наведеним у конфігурації, створюємо запис для нашого сайту
- додаємо імена локальних сайтів до локальної служби DNS
 = переходимо до C:\Windows\System32\drivers\etc
 = відкриваємо на редагування файл hosts
    127.0.0.1       spd-111.loc
	::1             spd-111.loc

    127.0.0.1       www.spd-111.loc
	::1             www.spd-111.loc
- зупиняємо та запускаємо Apache з панелі XAMPP
- мають з'явитися файли .log у папці логів
- у браузері набираємо http://spd-111.loc/